In [2]:
import pandas as pd
import numpy as np

In [2]:
obj = pd.Series([4,7,2,5])
obj

0    4
1    7
2    2
3    5
dtype: int64

In [3]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [4]:
obj.values

array([4, 7, 2, 5], dtype=int64)

In [5]:
obj2 = pd.Series([4,7,8,5], index=['a', 'b', 'c', 'd'])
obj2

a    4
b    7
c    8
d    5
dtype: int64

In [10]:
obj2["a":"c"]

a    4
b    7
c    8
dtype: int64

In [9]:
obj2[["a","c"]]

a    4
c    8
dtype: int64

In [13]:
obj2[obj2 > 6]

b    7
c    8
dtype: int64

In [15]:
sdata = {"Ohio":35000, "Texas":71000, "Oregon":16000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
dtype: int64

In [16]:
states = ["Cafe", "Texas", "Oregon"]
obj4 = pd.Series(sdata, states)
obj4

Cafe          NaN
Texas     71000.0
Oregon    16000.0
dtype: float64

In [29]:
obj3 + obj4

Cafe           NaN
Ohio           NaN
Oregon     32000.0
Texas     142000.0
dtype: float64

In [31]:
obj4.index=["aaa", 'bbb', 'ccc']
obj4

aaa        NaN
bbb    71000.0
ccc    16000.0
dtype: float64

In [6]:
data = {
    "state": ["holo", "honn", "nihi"],
    "year": [2000, 2001, 2002],
    "pop": [1.5, 1.2, 1.3]
}
frame = pd.DataFrame(data)
frame

  state  year  pop
0  holo  2000  1.5
1  honn  2001  1.2
2  nihi  2002  1.3

In [3]:
frame = pd.DataFrame(data, columns=["year", "state", "pop"])
frame

   year state  pop
0  2000  holo  1.5
1  2001  honn  1.2
2  2002  nihi  1.3

In [4]:
frame1 = pd.DataFrame(data, columns=["year", "state", "pop", "san"])
frame1

   year state  pop  san
0  2000  holo  1.5  NaN
1  2001  honn  1.2  NaN
2  2002  nihi  1.3  NaN

In [7]:
frame["year"]

0    2000
1    2001
2    2002
Name: year, dtype: int64

In [8]:
frame.year

0    2000
1    2001
2    2002
Name: year, dtype: int64

In [12]:
frame1["san"] = [2.3, 3.3, 3.4]
frame1

   year state  pop  san
0  2000  holo  1.5  2.3
1  2001  honn  1.2  3.3
2  2002  nihi  1.3  3.4

In [14]:
del frame1["san"]
frame1

   year state  pop
0  2000  holo  1.5
1  2001  honn  1.2
2  2002  nihi  1.3

In [15]:
frame["latest"] = frame.year > 2001
frame

  state  year  pop  latest
0  holo  2000  1.5   False
1  honn  2001  1.2   False
2  nihi  2002  1.3    True

In [16]:
#基本功能
obj = pd.Series([4.5, 3.3, 5.6, 5.2], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    3.3
a    5.6
c    5.2
dtype: float64

In [17]:
obj2 = obj.reindex(['a', 'b' ,'c', 'd'])
obj2

a    5.6
b    3.3
c    5.2
d    4.5
dtype: float64

In [19]:
obj3 = obj.reindex(['a', 'b' ,'c', 'd', 'e'])
obj3

a    5.6
b    3.3
c    5.2
d    4.5
e    NaN
dtype: float64

In [20]:
obj4 = obj.reindex(['a', 'b' ,'c', 'd', 'e'], fill_value=0)
obj4

a    5.6
b    3.3
c    5.2
d    4.5
e    0.0
dtype: float64

In [25]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)), index=['a', 'b', 'c'], columns=['ohio', 'teax', 'cali'])
frame

   ohio  teax  cali
a     0     1     2
b     3     4     5
c     6     7     8

In [26]:
frame.reindex(['b', 'c','a','d'])

   ohio  teax  cali
b   3.0   4.0   5.0
c   6.0   7.0   8.0
a   0.0   1.0   2.0
d   NaN   NaN   NaN

In [2]:
obj = pd.Series([4,7,8,5], index=['a', 'b', 'c', 'd'])
obj

a    4
b    7
c    8
d    5
dtype: int64

In [3]:
new_obj = obj.drop("c")
new_obj

a    4
b    7
d    5
dtype: int64

In [4]:
obj

a    4
b    7
c    8
d    5
dtype: int64

In [3]:
# 索引，选取和过滤
frame = pd.DataFrame(np.arange(16).reshape((4,4)), index=['a', 'b', 'c', "d"], columns=['ohio', 'teax', 'cali', 'moji'])
frame

   ohio  teax  cali  moji
a     0     1     2     3
b     4     5     6     7
c     8     9    10    11
d    12    13    14    15

In [18]:
frame[1:2]

   ohio  teax  cali  moji
b     4     5     6     7

In [26]:
frame['ohio']['a']

0

In [29]:
frame.iloc[2]
frame.iloc[:,2]
frame.iloc[1:3, 2:4]

   cali  moji
b     6     7
c    10    11

In [30]:
frame[frame<5]=0
frame

   ohio  teax  cali  moji
a     0     0     0     0
b     0     5     6     7
c     8     9    10    11
d    12    13    14    15

In [33]:
s1 = pd.Series(np.arange(5), index=list("abcde"))
s2 = pd.Series(np.arange(5), index=list("bcdef"))
print(s1)
print(s2)
s1 + s2

a    0
b    1
c    2
d    3
e    4
dtype: int32
b    0
c    1
d    2
e    3
f    4
dtype: int32

a    NaN
b    1.0
c    3.0
d    5.0
e    7.0
f    NaN
dtype: float64

In [32]:
s1.add(s2, fill_value=0)

a    0.0
b    1.0
c    3.0
d    5.0
e    7.0
f    4.0
dtype: float64

In [35]:
frame = pd.DataFrame(np.arange(16).reshape((4,4)), index=list('abcd'), columns=['ohio', 'teax', 'cali', 'moji'])
frame

   ohio  teax  cali  moji
a     0     1     2     3
b     4     5     6     7
c     8     9    10    11
d    12    13    14    15

In [37]:
frame.sub(s1, axis=0)

   ohio  teax  cali  moji
a   0.0   1.0   2.0   3.0
b   3.0   4.0   5.0   6.0
c   6.0   7.0   8.0   9.0
d   9.0  10.0  11.0  12.0
e   NaN   NaN   NaN   NaN

In [7]:
#应用函数
frame = pd.DataFrame(np.arange(16).reshape((4,4)), index=list('abcd'), columns=['ohio', 'teax', 'cali', 'moji'])
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

frame.apply(f, axis=1)

   min  max
a    0    3
b    4    7
c    8   11
d   12   15

In [9]:
f = lambda x: x * 2
frame.applymap(f)

   ohio  teax  cali  moji
a     0     2     4     6
b     8    10    12    14
c    16    18    20    22
d    24    26    28    30

In [13]:
# 排序
s1 = pd.Series(np.random.randn(10))
s1

0   -0.047309
1    0.584235
2   -0.838809
3   -0.201619
4    0.282696
5    0.170289
6    1.069280
7    1.553526
8   -1.090905
9   -0.942158
dtype: float64

In [14]:
s1.rank()

0     5.0
1     8.0
2     3.0
3     4.0
4     7.0
5     6.0
6     9.0
7    10.0
8     1.0
9     2.0
dtype: float64

In [15]:
s1 = pd.Series([2,4,6,6,4,4,2,2,])
s1

0    2
1    4
2    6
3    6
4    4
5    4
6    2
7    2
dtype: int64

In [18]:
s1.rank(method="max")

0    3.0
1    6.0
2    8.0
3    8.0
4    6.0
5    6.0
6    3.0
7    3.0
dtype: float64

In [21]:
s2 = pd.Series(np.arange(5), index=list("bdsac"))
s2

b    0
d    1
s    2
a    3
c    4
dtype: int32

In [22]:
s2.sort_index()

a    3
b    0
c    4
d    1
s    2
dtype: int32

In [30]:
frame = pd.DataFrame(np.arange(16).reshape((4,4)), index=list('abcd'), columns=['ohio', 'teax', 'cali', 'moji'])
frame["order"] = [4,2,2,1]
frame["order1"] = [4,3,2,1]
frame

   ohio  teax  cali  moji  order  order1
a     0     1     2     3      4       4
b     4     5     6     7      2       3
c     8     9    10    11      2       2
d    12    13    14    15      1       1

In [32]:
frame.sort_values(by=["order", "order1"])

   ohio  teax  cali  moji  order  order1
d    12    13    14    15      1       1
c     8     9    10    11      2       2
b     4     5     6     7      2       3
a     0     1     2     3      4       4

In [8]:
# 相关系数
frame = pd.DataFrame(np.random.randn(4,4), index=list('abcd'), columns=['ohio', 'teax', 'cali', 'moji'])
frame

       ohio      teax      cali      moji
a  0.050952 -0.534627  0.591505  0.185600
b  0.925103  1.000527  1.659485  1.212240
c  0.637704  0.993893 -0.002438  1.592567
d -0.762864  0.592085  0.114051 -0.862127

In [9]:
frame.ohio.corr(frame.cali)

0.5752709147267453

In [10]:
frame.corr()

          ohio      teax      cali      moji
ohio  1.000000  0.397847  0.575271  0.953409
teax  0.397847  1.000000  0.119906  0.456665
cali  0.575271  0.119906  1.000000  0.304036
moji  0.953409  0.456665  0.304036  1.000000

In [14]:
frame.cov()

          ohio      teax      cali      moji
ohio  0.555345  0.214666  0.324730  0.783813
teax  0.214666  0.524239  0.065762  0.364766
cali  0.324730  0.065762  0.573770  0.254066
moji  0.783813  0.364766  0.254066  1.217037

In [19]:
frame2 = pd.DataFrame(np.random.randn(4,4), index=list('abcd'), columns=['ohio', 'teax', 'cali', 'moji'])
frame2

       ohio      teax      cali      moji
a  1.020884 -1.200995 -0.097672 -0.719153
b -1.235923  0.007375 -0.855705  1.096699
c -0.300475 -1.014996 -1.225521  0.455533
d  0.765599  0.382198  1.034768 -0.018678

In [20]:
frame.corrwith(frame2)

ohio   -0.827694
teax    0.479800
cali   -0.300330
moji    0.593067
dtype: float64

In [29]:
frame = pd.DataFrame(np.arange(16).reshape((4,4)), index=list('abcd'), columns=['ohio', 'teax', 'cali', 'moji'])
frame

   ohio  teax  cali  moji
a     0     1     2     3
b     4     5     6     7
c     8     9    10    11
d    12    13    14    15

In [30]:
frame.ohio.value_counts()

12    1
4     1
8     1
0     1
Name: ohio, dtype: int64

In [26]:
obj = pd.Series(list("aabbsesseaabccse"))
obj

0     a
1     a
2     b
3     b
4     s
5     e
6     s
7     s
8     e
9     a
10    a
11    b
12    c
13    c
14    s
15    e
dtype: object

In [27]:
obj.unique()

array(['a', 'b', 's', 'e', 'c'], dtype=object)

In [28]:
obj.value_counts()

a    4
s    4
e    3
b    3
c    2
dtype: int64

In [33]:
obj2 = pd.Series(["a","f"])
obj2.isin(obj)

0     True
1    False
dtype: bool

In [3]:
data = pd.DataFrame({
    "qu1":[1,3,4,3,4],
    "qu2": [2,3,1,2,3],
    "qu3": [1,5,2,4,4]
})
data

   qu1  qu2  qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [4]:
data.apply(pd.value_counts)

   qu1  qu2  qu3
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [10]:
#缺失数据
data = pd.Series([1, np.nan, 3.5, 7, None, 8,9])
data

0    1.0
1    NaN
2    3.5
3    7.0
4    NaN
5    8.0
6    9.0
dtype: float64

In [12]:
data1 = data.dropna()
data1

0    1.0
2    3.5
3    7.0
5    8.0
6    9.0
dtype: float64

In [16]:
_ = data.dropna(inplace=True)
data

0    1.0
2    3.5
3    7.0
5    8.0
6    9.0
dtype: float64

In [17]:
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1] = np.nan
df.iloc[:2, 2] = np.nan
df

          0         1         2
0  0.091432       NaN       NaN
1 -0.910415       NaN       NaN
2  0.478608       NaN -0.674177
3 -0.406777       NaN  0.159866
4  0.909673 -0.364698  0.455247
5  0.965243  0.893216  0.109866
6 -0.270903  0.129998 -1.908889

In [19]:
df.dropna(thresh=2)

          0         1         2
2  0.478608       NaN -0.674177
3 -0.406777       NaN  0.159866
4  0.909673 -0.364698  0.455247
5  0.965243  0.893216  0.109866
6 -0.270903  0.129998 -1.908889

In [21]:
df.dropna(how='all')

          0         1         2
0  0.091432       NaN       NaN
1 -0.910415       NaN       NaN
2  0.478608       NaN -0.674177
3 -0.406777       NaN  0.159866
4  0.909673 -0.364698  0.455247
5  0.965243  0.893216  0.109866
6 -0.270903  0.129998 -1.908889

In [22]:
df.isnull()

       0      1      2
0  False   True   True
1  False   True   True
2  False   True  False
3  False   True  False
4  False  False  False
5  False  False  False
6  False  False  False

In [24]:
df.isna()

       0      1      2
0  False   True   True
1  False   True   True
2  False   True  False
3  False   True  False
4  False  False  False
5  False  False  False
6  False  False  False

In [26]:
#多重索引
data = pd.Series(np.random.randn(10), index=[['a','a','a','b','b','b','c','c','d','d'], [1,2,3,1,2,3,1,2,2,3]])
data

a  1    1.476442
   2    0.044459
   3    0.690034
b  1   -1.817178
   2    1.639110
   3   -0.133242
c  1   -1.298065
   2   -0.405280
d  2   -0.790346
   3   -1.107987
dtype: float64

In [27]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [31]:
data['a']

1    1.476442
2    0.044459
3    0.690034
dtype: float64

In [32]:
data[:,1]

a    1.476442
b   -1.817178
c   -1.298065
dtype: float64

In [33]:
data.unstack()

          1         2         3
a  1.476442  0.044459  0.690034
b -1.817178  1.639110 -0.133242
c -1.298065 -0.405280       NaN
d       NaN -0.790346 -1.107987

In [40]:
frame = pd.DataFrame(np.arange(12).reshape((4,3)), index=[['a','a','b','b'], [1,2,1,2]], columns=[['oho', 'oho', 'col'], ['green', 'red', 'green']])
frame

      oho       col
    green red green
a 1     0   1     2
  2     3   4     5
b 1     6   7     8
  2     9  10    11

In [56]:
frame["oho"]["green"]

a  1    0
   2    3
b  1    6
   2    9
Name: green, dtype: int32

In [58]:
frame.swaplevel(0,1, axis=1)

    green red green
      oho oho   col
a 1     0   1     2
  2     3   4     5
b 1     6   7     8
  2     9  10    11

In [60]:
frame.sortlevel(1)

C:\Users\lei_jia.NUANCE\AppData\Local\Continuum\anaconda3\envs\gluon\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

      oho       col
    green red green
a 1     0   1     2
b 1     6   7     8
a 2     3   4     5
b 2     9  10    11

In [61]:
frame.sum(level=1)

    oho       col
  green red green
1     6   8    10
2    12  14    16

In [5]:
# others
frame = pd.DataFrame({'a': np.arange(7), 'b': range(7,0,-1),  'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two' ], 'd':[0,1,2,0,1,2,3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [7]:
frame.set_index('b')

   a    c  d
b
7  0  one  0
6  1  one  1
5  2  one  2
4  3  two  0
3  4  two  1
2  5  two  2
1  6  two  3

In [14]:
frame.iloc[2:4]

   a  b    c  d
2  2  5  one  2
3  3  4  two  0